In [2]:
import io

import pandas as pd

In [5]:
type(io.StringIO(data))

_io.StringIO

In [6]:
data = '''Name|Age|Color
Fred|22|Red
Sally|29|Blue
George|24|
Fido||Black'''

df = pd.read_table(io.StringIO(data), sep='|')

In [7]:
df

     Name   Age  Color
0    Fred  22.0    Red
1   Sally  29.0   Blue
2  George  24.0    NaN
3    Fido   NaN  Black

## Filter Columns

In [8]:
df[['Name', 'Age']]

     Name   Age
0    Fred  22.0
1   Sally  29.0
2  George  24.0
3    Fido   NaN

In [9]:
mask = df.columns.str.startswith('A')
mask

array([False,  True, False])

In [10]:
df.iloc[:, mask]

    Age
0  22.0
1  29.0
2  24.0
3   NaN

In [13]:
df.iloc[:, ~mask]

     Name  Color
0    Fred    Red
1   Sally   Blue
2  George    NaN
3    Fido  Black